tests/loadtests/artillery/warmup.yml
config:
  processor: "./umbracoDataFlow.js"
  http:
    # 60 second http timeout for warmup
    timeout: 60
  phases:
    - duration: 1
      arrivalRate: 1
scenarios:
  - name: "Warmup"
    flow:
      - loop:
        - get:
            url: "/"
            afterResponse: "expect200Or302"
        - think: 2
        count: 5